Revit 2026 API

# ParameterFilterUtilitiesRemoveUnfilterableCategories Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> RemoveUnfilterableCategories(
	ICollection<ElementId> categories
)
```
```vb
Public Shared Function RemoveUnfilterableCategories (
	categories As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ RemoveUnfilterableCategories(
	ICollection<ElementId^>^ categories
)
```
```fsharp
static member RemoveUnfilterableCategories :
        categories : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

categories ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace